tests/load/report.txt
  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(99)<300' p(99)=175.7ms


  █ TOTAL RESULTS 

    checks_total.......: 30438   1009.30378/s
    checks_succeeded...: 100.00% 30438 out of 30438
    checks_failed......: 0.00%   0 out of 30438

    ✓ team created or exists
    ✓ PR created

    HTTP
    http_req_duration..............: avg=48.16ms min=511.99µs med=33.83ms  max=277.03ms p(90)=112.62ms p(95)=134.53ms
      { expected_response:true }...: avg=51.76ms min=2.27ms   med=34.54ms  max=277.03ms p(90)=124.01ms p(95)=147.06ms
    http_req_failed................: 50.00% 15219 out of 30438
    http_reqs......................: 30438  1009.30378/s

    EXECUTION
    iteration_duration.............: avg=197.6ms min=103.87ms med=192.64ms max=501.66ms p(90)=286.46ms p(95)=314.7ms 
    iterations.....................: 15219  504.65189/s
    vus............................: 100    min=100            max=100
    vus_max........................: 100    min=100            max=100

    NETWORK
    data_received..................: 7.9 MB 263 kB/s
    data_sent......................: 15 MB  487 kB/s



running (0m30.2s), 000/100 VUs, 15219 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  30s